In [1]:
import pandas as pd
import numpy as np

In [2]:
list = [[1,3,5,6,7], [4,9,3,7,12]]

In [3]:
x=np.array([list])

In [4]:
type(x)

numpy.ndarray

In [5]:
x

array([[[ 1,  3,  5,  6,  7],
        [ 4,  9,  3,  7, 12]]])

In [6]:
?x

In [7]:
x.shape

(1, 2, 5)

In [8]:
?x.shape

In [9]:
df1= pd.DataFrame({"city":["Bhopal","indore","Rewa", "pune", "mumbai"], "rank":[12,13,14,15,16]})
df1

     city  rank
0  Bhopal    12
1  indore    13
2    Rewa    14
3    pune    15
4  mumbai    16

In [10]:
df2= pd.DataFrame({"city":["Bhopal","pune","Rewa","delhi"], "temperature":[30,28,34,21]})
df2

     city  temperature
0  Bhopal           30
1    pune           28
2    Rewa           34
3   delhi           21

In [11]:
df3=pd.merge(df1,df2, on="city")
df3

     city  rank  temperature
0  Bhopal    12           30
1    Rewa    14           34
2    pune    15           28

In [12]:
df3=pd.merge(df1,df2, on="city", how="outer")
df3

     city  rank  temperature
0  Bhopal  12.0         30.0
1  indore  13.0          NaN
2    Rewa  14.0         34.0
3    pune  15.0         28.0
4  mumbai  16.0          NaN
5   delhi   NaN         21.0

In [13]:
df4=pd.merge(df1,df2, on="city", how="left")
df4

     city  rank  temperature
0  Bhopal    12         30.0
1  indore    13          NaN
2    Rewa    14         34.0
3    pune    15         28.0
4  mumbai    16          NaN

In [14]:
df4=pd.merge(df1,df2, on="city", how="right")
df4

     city  rank  temperature
0  Bhopal  12.0           30
1    pune  15.0           28
2    Rewa  14.0           34
3   delhi   NaN           21